/*
bj2357 최솟값과 최댓값

N(<=100'000)개의 정수 배열에서,
M개의 구간 쿼리를 수행하라. (최소, 최댓값)

접근법: 간단한 세그먼트 트리(수정 없음)

최소값, 최대값을 따로 보관하는 세그먼트 트리를 구축하면 된다.

주의:
1. 입력이 많으므로 최대한 입력을 먼저 다 받고 연산을 한다.
	(연산과 입력을 번갈아가며 하지 않는다.)
2. std::cin.tie(0), std::ios_base::sync_with_stdio(0)를 사용한다.
3(optional). 백준 저지는 터미널에 연결된 표준 입출력을 사용하는 것이 아니라
	파일을 파이프로 입력하는 식으로 프로그램을 구동하므로,
	표준 입출력을 사용하는 것보다 메모리 시스템 콜을 사용하여
	입력 전체를 먼저 메모리에 올린 후 사용하는 것이
	압도적으로 빠르다.
*/

#include<iostream>
#include<vector>

class SegmentTree
{
public:
	explicit SegmentTree

};

int main() {

	return 0;
}